#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # dnsimple_record.txt_nathan_test will be created
  + resource "dnsimple_record" "txt_nathan_test" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + name      = "_actions"
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "TXT"
      + value     = "works"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `terraform`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
